#存放参数


#******************************************************************************
#replace_word_lst 用于 replace_aline_lst函数,将aline["raw_text"]中的词语替换
#生成aline["text"]
#******************************************************************************
replace_word_lst =[
#correction_replace_lst
    ("mz" , "㎡"),
    ("m2" , "㎡"),
    ("m3" , "m³"),
    (":" , "："),
    ("／", "/"),
    ("(" , "（"),
    (")" , "）"),
    (" " , ""), #全角空格
    (" ",""),#半角空格
    ("．" , "."),
    ("," , "，"),
    (";" , "；"),
    ("房问","房间"),
    ("空问","空间"),
    # ("oo","00"),
    # ("OO","00"),
    ("\n" , ""),
#markdown_replace_lst
     ('┃','|'),
    ('\\','\\\\'),
    ('`','\`'),
    ('*','\*'),
    ('_','\_'),
    ('#','\#'),
    ('+','\+'),
    ('!','\!'),]

#******************************************************************************
#cft_con_lst 添加aline["cft"]属性,即上下文无关类型
#******************************************************************************
cft_con_lst=[
    "cft_empty",
    "cft_page",
    "cft_0p0p0",
    "cft_0p0",
    "cft_0",
    ]
#******************************************************************************
#cft_info_dic 添加aline["cft_info"]属性
#******************************************************************************
cft_info_dic={
    "cft_page":"cft_page_info",
    "cft_0p0p0":"cft_0p0p0_info",
    "cft_0p0":"cft_0p0_info",
    "cft_0":"cft_0_info",
}
#******************************************************************************
#cst_con_lst 添加aline["cst"]属性,即上下文有关类型
#******************************************************************************
cst_con_lst=[
    "cst_term",
    "cst_index",
    "cst_subtitle",
    "cst_title",
    "cst_term_content",
    ]

#******************************************************************************
#md_con_dic 用于 add_md函数,添加aline["md"]属性,即md格式内容
#******************************************************************************
md_con_dic={
    "cst_index":"md_index",
    "cst_subtitle":"md_subtitle",
    "cst_title":"md_title",
    "cft_empty":"md_empty",
    "cst_term":"md_term",
    "cst_term_content":"md_term_content",
    }
#******************************************************************************
# del_con_lst 用于 del_lst 函数,表示删除的内容
#******************************************************************************
del_con_lst=[
    "cft_empty",
    "cft_page",
    ]
#******************************************************************************
# insert_con_dic 用于 insert_lst 函数,表示插入的情况和内容
#******************************************************************************
insert_con_dic={
    "cst_index":"insert_empty",
    "cst_subtitle":"insert_empty",
    "cst_title":"insert_empty",
    "cst_term":"insert_empty",
    }
#******************************************************************************
# merge_con_lst 用于 merge_lst 函数,表示连接的内容
#******************************************************************************
merge_con_lst=[
    "cft_empty",
    "cst_index",
    "cst_subtitle",
    "cst_title",
    "cst_term",
    "cst_term_content",
    ]